exports/physics/wavves.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-16 Mon 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Waves</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Waves</h1>
<p>
\[
y(x,t) = y_m sin(kx-\omega t)
\]
</p>

<p>
k = angular wave number
w = angular frequency
</p>

<p>
Traveling waves are generally expressed as:
</p>

<p>
\[
y(x,t) = h(kx\pm \omega t)
\]
</p>

<div id="outline-container-org42ee60a" class="outline-2">
<h2 id="org42ee60a"><span class="section-number-2">1</span> Attributes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc67db0a" class="outline-3">
<h3 id="orgc67db0a"><span class="section-number-3">1.1</span> Wavelength to k</h3>
<div class="outline-text-3" id="text-1-1">
<p>
\[
k = \frac{2\pi}{\lambda}
\]
</p>
</div>
</div>

<div id="outline-container-org3620123" class="outline-3">
<h3 id="org3620123"><span class="section-number-3">1.2</span> Period to frequency</h3>
<div class="outline-text-3" id="text-1-2">
<p>
\[
\frac{\omega}{2\pi} = f = T^{-1}
\]
</p>
</div>
</div>

<div id="outline-container-org302ca29" class="outline-3">
<h3 id="org302ca29"><span class="section-number-3">1.3</span> Wave speed</h3>
<div class="outline-text-3" id="text-1-3">
<p>
\[
v =\frac{\omega}{k} =\frac{\lambda}{T} = \lambda f
\]
</p>
</div>
</div>

<div id="outline-container-org24465a4" class="outline-3">
<h3 id="org24465a4"><span class="section-number-3">1.4</span> Wave speed on stretched string</h3>
<div class="outline-text-3" id="text-1-4">
<p>
\[
v=\sqrt{\frac{\tau}{\mu}}
\]
</p>

<p>
\(\tau\) = tension
\(\mu\) = linear density
</p>
</div>
</div>

<div id="outline-container-org92cdef6" class="outline-3">
<h3 id="org92cdef6"><span class="section-number-3">1.5</span> Average Power of a wave on a stretched string</h3>
<div class="outline-text-3" id="text-1-5">
<p>
\[
P_{avg} = \frac{1}{2}\mu v \omega^2 y_m^2
\]
</p>
</div>
</div>
</div>


<div id="outline-container-org012412c" class="outline-2">
<h2 id="org012412c"><span class="section-number-2">2</span> Interactions</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org39d62f0" class="outline-3">
<h3 id="org39d62f0"><span class="section-number-3">2.1</span> Interference</h3>
<div class="outline-text-3" id="text-2-1">
<p>
\[
y'(x,t) = [2y_m \cos \frac{1}{2}\phi] \sin(kx-\omega t +\frac{1}{2}\phi)
\]
</p>

<p>
Interference of two waves with same direction, amplitude, frequency (thus wavelength)
but different phase constant \(\phi\)
</p>
</div>
</div>
</div>

<div id="outline-container-org1a2132a" class="outline-2">
<h2 id="org1a2132a"><span class="section-number-2">3</span> Power</h2>
<div class="outline-text-2" id="text-3">
<p>
\[
P_{avg} = \frac{1}{2}\mu v \omega^2 y_m^2
\]
</p>
</div>
</div>

<div id="outline-container-org6113dd2" class="outline-2">
<h2 id="org6113dd2"><span class="section-number-2">4</span> Wave equation</h2>
<div class="outline-text-2" id="text-4">
<p>
\[
\pdv[2]{y}{x} = \frac{1}{v^2}\pdv[2]{y}{t}
\]
</p>
</div>
</div>

<div id="outline-container-org8b60ad3" class="outline-2">
<h2 id="org8b60ad3"><span class="section-number-2">5</span> Standing waves</h2>
<div class="outline-text-2" id="text-5">
<p>
\[
y'(x,t) =[2y_m \sin kx] \cos \omega t
\]
</p>

<p>
nodes:
\[
x=n {\lambda \over 2}
\]
</p>

<p>
antinodes:
\[
x=(n+{1\over2}){\lambda \over 2}
\]
</p>

<p>
harmonic series:
</p>

<p>
\[
\lambda = \frac{2L}{n}
\]
</p>

<p>
\[
f=n\frac{v}{2L}
\]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-08-16 Mon 17:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
